# Rappels

In [2]:
import pandas as pd 
df_titanic = pd.read_csv("../data/titanic.csv").sample(500)

In [4]:
pd.pivot_table(df_titanic, index=["Sex", "Pclass"], values="Survived")

               Survived
Sex    Pclass
female 1       0.978723
       2       0.952381
       3       0.476190
male   1       0.365079
       2       0.131148
       3       0.113300

In [7]:
# Noter que le résultat précédent est équivalent à 
df_titanic.groupby(["Sex", "Pclass"])["Survived"].mean()

Sex     Pclass
female  1         0.978723
        2         0.952381
        3         0.476190
male    1         0.365079
        2         0.131148
        3         0.113300
Name: Survived, dtype: float64

In [14]:
pd.pivot_table(df_titanic, index=["Sex", "Pclass"], columns="Survived", values="Fare")

Survived                0           1
Sex    Pclass
female 1       151.550000  108.111863
       2        14.833333   22.559375
       3        18.735419   12.399493
male   1        64.145829   56.150179
       2        21.662159   21.592708
       3        12.781865   15.648703

In [17]:
pd.pivot_table(df_titanic, index=["Sex"], columns="Survived", values=["SibSp", "Parch"])

             Parch               SibSp
Survived         0         1         0         1
Sex
female    1.085106  0.566176  1.021277  0.573529
male      0.242063  0.430769  0.547619  0.430769

In [19]:
pd.crosstab(df_titanic.Sex, df_titanic.Survived)

Survived    0    1
Sex
female     47  136
male      252   65

Exercice

In [ ]:
# Proposer une visualisation pour connaître l'influence du lieu d'embarquement sur la survie